Repository: heseenahmed/FleetLinker
Catalog: FleetLinker/Resources/Messages.*.resx
Languages: ar

source: Success
ar: نجاح

source: Failed
ar: فشل

source: Error
ar: خطأ

source: Validation Error
ar: خطأ في التحقق

source: Model validation failed
ar: فشل التحقق من صحة البيانات

source: Invalid ID.
ar: المعرف غير صالح.

# BodyRequired
source: Body is required.
ar: البيانات مطلوبة.

source: Invalid Argument
ar: معامل غير صالح

source: Unauthorized
ar: غير مصرح

source: User not authenticated.
ar: المستخدم غير مسجل دخول.

source: Invalid credentials.
ar: بيانات الاعتماد غير صالحة.

source: Invalid access token.
ar: رمز الوصول غير صالح.

source: Invalid or expired token.
ar: رمز غير صالح أو منتهي الصلاحية.

source: Invalid or expired refresh token.
ar: رمز التحديث غير صالح أو منتهي الصلاحية.

source: User not found.
ar: المستخدم غير موجود.

source: User not found or inactive.
ar: المستخدم غير موجود أو غير نشط.

# UserNotFoundOrDeleted
source: User not found or already deleted.
ar: المستخدم غير موجود أو محذوف مسبقاً.

source: Target user not found.
ar: المستخدم المستهدف غير موجود.

# PerformerNotFound
source: Performer not found in system.
ar: المنفذ غير موجود في النظام.

source: User registered successfully.
ar: تم تسجيل المستخدم بنجاح.

source: User updated successfully.
ar: تم تحديث المستخدم بنجاح.

source: User deleted successfully.
ar: تم حذف المستخدم بنجاح.

source: User activated successfully.
ar: تم تفعيل المستخدم بنجاح.

source: User deactivated.
ar: تم إلغاء تفعيل المستخدم.

# UserInfoRetrieved
source: User information retrieved successfully.
ar: تم استرجاع معلومات المستخدم بنجاح.

# UsersInfoRetrieved
source: Users information retrieved successfully.
ar: تم استرجاع معلومات المستخدمين بنجاح.

source: User roles updated.
ar: تم تحديث أدوار المستخدم.

source: Invalid user ID.
ar: معرف المستخدم غير صالح.

# UserIdRequired
source: User ID is required.
ar: معرف المستخدم مطلوب.

# UserDataMissingOrInconsistent
source: User data is missing or inconsistent.
ar: بيانات المستخدم مفقودة أو غير متسقة.

# UserUpdateDataRequired
source: User update data is required.
ar: بيانات تحديث المستخدم مطلوبة.

source: Failed to update user.
ar: فشل في تحديث المستخدم.

# RegistrationPayloadRequired
source: Registration payload is required.
ar: بيانات التسجيل مطلوبة.

source: Registration failed internally.
ar: فشل التسجيل داخلياً.

# LoginPayloadRequired
source: Login payload is required.
ar: بيانات تسجيل الدخول مطلوبة.

# UsernameAndPasswordRequired
source: Username and password are required.
ar: اسم المستخدم وكلمة المرور مطلوبان.

# InvalidPassword
source: Invalid password. Please try again.
ar: كلمة المرور غير صحيحة. يرجى المحاولة مرة أخرى.

source: Login successful.
ar: تم تسجيل الدخول بنجاح.

source: Logout successful.
ar: تم تسجيل الخروج بنجاح.

source: Logout successful (all devices).
ar: تم تسجيل الخروج بنجاح (جميع الأجهزة).

# OldAndNewPasswordsRequired
source: Old and new passwords are required.
ar: كلمة المرور القديمة والجديدة مطلوبتان.

# MobileAndPasswordRequired
source: Mobile and password are required.
ar: رقم الجوال وكلمة المرور مطلوبان.

source: Password changed successfully.
ar: تم تغيير كلمة المرور بنجاح.

# TokenRequired
source: Token is required.
ar: الرمز مطلوب.

source: Token refreshed successfully.
ar: تم تحديث الرمز بنجاح.

source: Roles retrieved successfully.
ar: تم استرجاع الأدوار بنجاح.

# RoleNameRequired
source: Role name is required.
ar: اسم الدور مطلوب.

source: Role Name cannot be null.
ar: اسم الدور لا يمكن أن يكون فارغاً.

# RoleNotFound
source: Role {0} not found.
ar: الدور {0} غير موجود.

source: Role Added Successfully!
ar: تمت إضافة الدور بنجاح!

source: Role Deleted Successfully!
ar: تم حذف الدور بنجاح!

# ErrorAddingRole
source: Error when adding new role.
ar: حدث خطأ عند إضافة دور جديد.

# RoleIdsCannotBeNull
source: RoleIds cannot be null. Send empty list to remove all roles.
ar: قائمة الأدوار لا يمكن أن تكون فارغة. أرسل قائمة فارغة لإزالة جميع الأدوار.

source: Not Found
ar: غير موجود

source: Operation Failed
ar: فشلت العملية

source: Database Error
ar: خطأ في قاعدة البيانات

# DatabaseErrorOccurred
source: A database error occurred.
ar: حدث خطأ في قاعدة البيانات.

source: SQL Error
ar: خطأ SQL

source: Application Error
ar: خطأ في التطبيق

source: Server Error
ar: خطأ في الخادم

# UnexpectedErrorOccurred
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Error Update Role
ar: حدث خطأ عند تعديل الدور .

source: Invalid Email Address
ar: عنوان البريد الالكتروني غير صحيح

source: ErrorDeleteRole
ar: حدث خطأ اثناء حذف الدور

source: Invalid Token Algorithm
ar: حدث خطأ في الالجورزم الخاص بانشاء الرمز

# ErrorRetrievingUserInfo
source: Error While Retrieving User Information
ar: حدث خطأ أثناء جلب بيانات المستخدم

# EmailAlreadyInUseByAnotherUser
source: This Email Already in Use By Another User
ar: هذا البريد الالكتروني مستخدم بالفعل من مستخدم اخر

source: Mobile Number Already In Use By Another User
ar: رقم الجوال مستخدم بالفعل من مستخدم اخر

source: Failed To Assign Roles
ar: حدث خطأ اثناء اضافة الادوار للمستخدم

source: Full Name Required
ar: اسم المستخدم مطلوب

source: Email Required
ar: البريد الالكتروني مطلوب

source: Mobile Required
ar: رقم الجوال مطلوب

# DuplicateEmail
source: Multiple users found with the same email.
ar: يوجد مستخدم اخر يستخدم ذلك البريد الالكتروني

# FailedToCreateUser
source: User creation failed
ar: فشل انشاء مستخدم جديد

source: User Already Deleted
ar: المستخدم تمت ازالته بالفعل

source: Failed To Delete User
ar: حدث خطأ اثناء حذف المستخدم

source: Some Roles Do Not Exist
ar: بعض من الادوار غير مجوده
